
#Область ОбработчикиСобытийФормы

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	Если Не ПустаяСтрока(ПараметрЗапуска) Тогда
		УбратьБезопасныйРежимПодключенияРасширения();
		ЗавершитьРаботуСистемы(Ложь);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура Сделать(Команда)
	УбратьБезопасныйРежимПодключенияРасширения();
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервереБезКонтекста
Процедура УбратьБезопасныйРежимПодключенияРасширения()
	
	Для Каждого Расширение Из РасширенияКонфигурации.Получить() Цикл
		Расширение.БезопасныйРежим = Ложь;
		Расширение.Записать();
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти
