
#Область ОбработчикиСобытийФормы

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ПодключитьОбработчикОжидания("ПроверкаВыполненостиОбновления", 5);
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура ПроверкаВыполненостиОбновления()
	
	Если ПрочитатьСобытиеЗавершенияОбновления() Тогда
		ЗавершитьРаботуСистемы(Ложь);
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция ПрочитатьСобытиеЗавершенияОбновления()
	Возврат РеквизитФормыВЗначение("Объект").ПрочитатьСобытиеЗавершенияОбновления();
КонецФункции

#КонецОбласти
