
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Прочитать событие завершения обновления.
// 
// Возвращаемое значение:
//  Булево - Истина, если обновление завершено.
//
Функция ПрочитатьСобытиеЗавершенияОбновления() Экспорт
	
	Результат = Истина;
	
	Попытка
		Результат =  Не Вычислить("ОбновлениеИнформационнойБазы.НеобходимоОбновлениеИнформационнойБазы()");
	Исключение
	КонецПопытки;
	
	Возврат Результат;
	
КонецФункции

// Интервал опроса.
// 
// Возвращаемое значение:
//  Число - значение интервала.
//
Функция ИнтервалОпроса() Экспорт
	Возврат 3;
КонецФункции

// Прочитать параметры запуска.
//
// Параметры:
//  Строка - Строка - входная строка запуска.
// 
// Возвращаемое значение:
//  Строка - выходная строка.
//
Функция ПрочитатьПараметрыЗапуска(Строка) Экспорт
	Возврат Строка;
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция Пауза(Время)
	
	ВремяЗавершения = ТекущаяДата() + Время;
	Пока ТекущаяДата() < ВремяЗавершения Цикл
	КонецЦикла;
	
КонецФункции

#КонецОбласти

#КонецЕсли
