
#Область ОбработчикиСобытийФормы

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	УбратьБезопасныйРежимПодключенияРасширения();
	ЗавершитьРаботуСистемы(Ложь);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервереБезКонтекста
Процедура УбратьБезопасныйРежимПодключенияРасширения()
	
	Для Каждого Расширение Из РасширенияКонфигурации.Получить() Цикл
		
		Если Не Расширение.БезопасныйРежим Тогда
			Продолжить;
		КонецЕсли;
		
		Расширение.БезопасныйРежим = Ложь;
		Расширение.Записать();
		
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти
